In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20180607',periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)),index=dates,columns=['A','B','C','D'])

# 设置空值

In [3]:
df.iloc[0,1] = np.nan
df.iloc[1,2] = np.nan

In [4]:
df

             A     B     C   D
2018-06-07   0   NaN   2.0   3
2018-06-08   4   5.0   NaN   7
2018-06-09   8   9.0  10.0  11
2018-06-10  12  13.0  14.0  15
2018-06-11  16  17.0  18.0  19
2018-06-12  20  21.0  22.0  23

# 清空空值行

In [5]:
df.dropna(axis=0)

             A     B     C   D
2018-06-09   8   9.0  10.0  11
2018-06-10  12  13.0  14.0  15
2018-06-11  16  17.0  18.0  19
2018-06-12  20  21.0  22.0  23

# 清空空值行-如有任意一行有空值，则清除

In [6]:
df.dropna(axis=0,how='any')

             A     B     C   D
2018-06-09   8   9.0  10.0  11
2018-06-10  12  13.0  14.0  15
2018-06-11  16  17.0  18.0  19
2018-06-12  20  21.0  22.0  23

# 清空空值行-要求一行全部为空值，则清除

In [7]:
df.dropna(axis=0,how='all')

             A     B     C   D
2018-06-07   0   NaN   2.0   3
2018-06-08   4   5.0   NaN   7
2018-06-09   8   9.0  10.0  11
2018-06-10  12  13.0  14.0  15
2018-06-11  16  17.0  18.0  19
2018-06-12  20  21.0  22.0  23

# 填充空值

In [8]:
df.fillna(value=0)

             A     B     C   D
2018-06-07   0   0.0   2.0   3
2018-06-08   4   5.0   0.0   7
2018-06-09   8   9.0  10.0  11
2018-06-10  12  13.0  14.0  15
2018-06-11  16  17.0  18.0  19
2018-06-12  20  21.0  22.0  23

# 判断是否有数据缺失

In [9]:
df.isnull()

                A      B      C      D
2018-06-07  False   True  False  False
2018-06-08  False  False   True  False
2018-06-09  False  False  False  False
2018-06-10  False  False  False  False
2018-06-11  False  False  False  False
2018-06-12  False  False  False  False

# 判断至少有一个为真

In [10]:
np.any(df.isnull())

True